# Pandas
- 판다스는 2가지 데이터 자료 유형이 있다.
- 데이터 자료 유형: 
    - `Series` : column 하나
    - `DataFrame` : column, row가 있는 데이터(엑셀과 비슷) / 시리즈가 모여서 데이터프레임이 됨
- 사진 하나 있으면 좋을듯

## Series

In [2]:
import pandas as pd

In [2]:
pd.date_range('2022-01-01', '2023-01-01', freq = 'M') # (시작, 끝, freq(주기)) / M = 월말

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-31'],
              dtype='datetime64[ns]', freq='M')

In [3]:
pd.date_range('2022-01-01', '2023-01-01', freq = 'MS') # MS = 월초(1일)

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01',
               '2023-01-01'],
              dtype='datetime64[ns]', freq='MS')

In [4]:
prices = [1000, 1010, 1020]
dates = pd.date_range('2023-01-01', periods = 3) # periods(몇개)
dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03'], dtype='datetime64[ns]', freq='D')

In [6]:
# Series 데이터 만들기
Series1 = pd.Series(prices, index = dates) # (value, 내가 활용할 인덱스)
Series1

2023-01-01    1000
2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

In [7]:
# 값 추가
Series1['2023-01-04'] = 1030
Series1

2023-01-01    1000
2023-01-02    1010
2023-01-03    1020
2023-01-04    1030
Freq: D, dtype: int64

In [8]:
# 원하는 데이터만 boolean 추출하기
Series1[1:3]

2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

In [9]:
Series1[2]

1020

In [11]:
Series1['2023-01-02'] # 딕셔너리와 비슷

1010

In [12]:
# 인덱스 없이 series 만들기 > 0부터 차례로 값이 들어간다
Series2 = pd.Series(prices)
Series2

0    1000
1    1010
2    1020
dtype: int64

In [13]:
Series2[3] = 1030
Series2

0    1000
1    1010
2    1020
3    1030
dtype: int64

In [ ]:
# 시리즈에서 다룰 시계열 데이터.. data_range!!는 기억하기!!

## DataFrame

In [1]:
# 딕셔너리 활용해서 df 만들기 > key값이 column, 리스트의 찻번째 요소가 0번째 row.
# 원소 개수, 사이즈가 같아야 df를 만들 수 있다.
# value 길이가 크기, 길이가 같아야 한다.
prices = {
    "A텔레콤" : [48000, 48500, 49000],
    "B전자" : [60000, 61000, 62000],
    "C은행" : [54000, 55000, 56000]
}

# 인덱스x
df1 = pd.DataFrame(prices)
df1

NameError: name 'pd' is not defined

In [17]:
dates = pd.date_range('2023-01-02', periods = 3)
dates

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04'], dtype='datetime64[ns]', freq='D')

In [18]:
# 인덱스 O
df2 = pd.DataFrame(prices, index = dates)
df2

             A텔레콤    B전자    C은행
2023-01-02  48000  60000  54000
2023-01-03  48500  61000  55000
2023-01-04  49000  62000  56000

## 데이터 선택
- iloc: **데이터 순서(번호)** 로 데이터를 가져온다.
- loc: **index**, **column**으로 데이터를 가져온다.

In [19]:
df2

             A텔레콤    B전자    C은행
2023-01-02  48000  60000  54000
2023-01-03  48500  61000  55000
2023-01-04  49000  62000  56000

In [20]:
df2.iloc[0] # row

A텔레콤    48000
B전자     60000
C은행     54000
Name: 2023-01-02 00:00:00, dtype: int64

In [21]:
df2.iloc[:, 0] # column

2023-01-02    48000
2023-01-03    48500
2023-01-04    49000
Freq: D, Name: A텔레콤, dtype: int64

In [22]:
df2.iloc[0, 0]

48000

In [23]:
df2.loc[0,0] # error

KeyError: 0

In [24]:
df2.loc['2023-01-02', 'A텔레콤']

48000

In [26]:
df2.loc['2023-01-02']

A텔레콤    48000
B전자     60000
C은행     54000
Name: 2023-01-02 00:00:00, dtype: int64

In [25]:
df2.loc[:, 'A텔레콤']

2023-01-02    48000
2023-01-03    48500
2023-01-04    49000
Freq: D, Name: A텔레콤, dtype: int64

In [27]:
# column 가져오기1
df2['A텔레콤']

2023-01-02    48000
2023-01-03    48500
2023-01-04    49000
Freq: D, Name: A텔레콤, dtype: int64

In [28]:
# column 가져오기2
df2.A텔레콤

2023-01-02    48000
2023-01-03    48500
2023-01-04    49000
Freq: D, Name: A텔레콤, dtype: int64

In [29]:
df2['A텔레콤']['2023-01-03']

48500

In [30]:
df2.loc[:,'A텔레콤']['2023-01-03']

48500

In [ ]:
# 데이터 추가하기

In [31]:
df2['D철강'] = [5000, 5100, 5200]
df2

             A텔레콤    B전자    C은행   D철강
2023-01-02  48000  60000  54000  5000
2023-01-03  48500  61000  55000  5100
2023-01-04  49000  62000  56000  5200

### [실습] 
**Q1. 2023년 1월 3일 ~ 2023년 1월 4일까지의 'B전자', 'C은행' 데이터를 가져와주세요.(iloc,loc 각각 활용)**

In [32]:
df2

             A텔레콤    B전자    C은행   D철강
2023-01-02  48000  60000  54000  5000
2023-01-03  48500  61000  55000  5100
2023-01-04  49000  62000  56000  5200

In [33]:
df2.iloc[1:,1:3]

              B전자    C은행
2023-01-03  61000  55000
2023-01-04  62000  56000

In [35]:
df2.loc['2023-01-03':, 'B전자':'C은행'] # loc는 뒤에 범위도 다 포함됨('D철강'(x))

              B전자    C은행
2023-01-03  61000  55000
2023-01-04  62000  56000

### [실습]
**Q2. 데이터 61000원 가져오기(iloc, loc 각각 활용).**

In [36]:
df2

             A텔레콤    B전자    C은행   D철강
2023-01-02  48000  60000  54000  5000
2023-01-03  48500  61000  55000  5100
2023-01-04  49000  62000  56000  5200

In [38]:
df2.iloc[1,1]

61000

In [39]:
df2.loc['2023-01-03', 'B전자']

61000

## 데이터프레임 확장
- concat: 그냥 가져다 붙이는 것 (index, columns 완전히 같은 경우에 사용) ex. 1분기data, 2분기data => 같은 모양 다른 데이터
- merge: 공통된 칼럼이나 인덱스가 있는 경우 결합
- 둘의 차이 알기!

In [54]:
s1 = pd.Series([3000, 3100, 3200])
s1.name = 'F화학' # 시리즈 이름 = 컬럼 이름
s1

0    3000
1    3100
2    3200
Name: F화학, dtype: int64

In [55]:
df2

             A텔레콤    B전자    C은행   D철강
2023-01-02  48000  60000  54000  5000
2023-01-03  48500  61000  55000  5100
2023-01-04  49000  62000  56000  5200

In [57]:
# 잘못된 예
pd.concat([df2, s1], axis = 1)

                        A텔레콤      B전자      C은행     D철강     F화학
2023-01-02 00:00:00  48000.0  60000.0  54000.0  5000.0     NaN
2023-01-03 00:00:00  48500.0  61000.0  55000.0  5100.0     NaN
2023-01-04 00:00:00  49000.0  62000.0  56000.0  5200.0     NaN
0                        NaN      NaN      NaN     NaN  3000.0
1                        NaN      NaN      NaN     NaN  3100.0
2                        NaN      NaN      NaN     NaN  3200.0

In [ ]:
# concat으로 데이터 합쳐주려면 index가 같아야 함

In [63]:
dates = pd.date_range('2023-01-02', periods = 3)
s1 = pd.Series([3000, 3100, 3200], index = dates)
s1.name = 'F화학' # 시리즈 이름 = 컬럼 이름
s1

2023-01-02    3000
2023-01-03    3100
2023-01-04    3200
Freq: D, Name: F화학, dtype: int64

In [64]:
df2

             A텔레콤    B전자    C은행   D철강
2023-01-02  48000  60000  54000  5000
2023-01-03  48500  61000  55000  5100
2023-01-04  49000  62000  56000  5200

In [65]:
concat_df2 = pd.concat([df2, s1], axis = 1) # df+df, df+series 다 가능하다 / 축의 방향
concat_df2

             A텔레콤    B전자    C은행   D철강   F화학
2023-01-02  48000  60000  54000  5000  3000
2023-01-03  48500  61000  55000  5100  3100
2023-01-04  49000  62000  56000  5200  3200

In [66]:
concat_df2['F화학_add_500'] = concat_df2['F화학'] + 500
concat_df2.head()

             A텔레콤    B전자    C은행   D철강   F화학  F화학_add_500
2023-01-02  48000  60000  54000  5000  3000         3500
2023-01-03  48500  61000  55000  5100  3100         3600
2023-01-04  49000  62000  56000  5200  3200         3700

In [67]:
# index 방향으로 데이터 추가하기

In [68]:
concat_df2.loc['2023-01-06', :] = [50000, 63000, 57000, 5300, 3300, 3800]
concat_df2

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-04  49000.0  62000.0  56000.0  5200.0  3200.0       3700.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0

In [70]:
concat_df2.loc['2023-01-05', :] = concat_df2.loc['2023-01-06', :] - 50 
concat_df2.head()

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-04  49000.0  62000.0  56000.0  5200.0  3200.0       3700.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0

In [73]:
# 만약 잘 추가가 안될 때 - datetime으로 형변환 해주기(안전하게 양쪽 다!)
print(type('2023-01-05'))
print(type(pd.to_datetime('2023-01-05')))

<class 'str'>
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [74]:
concat_df2.sort_index()

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-04  49000.0  62000.0  56000.0  5200.0  3200.0       3700.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0

In [78]:
# 특정 columns 기준으로 sort > 이걸 훨씬 많이 씀
concat_df2.sort_values(by = 'B전자')

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-04  49000.0  62000.0  56000.0  5200.0  3200.0       3700.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0

In [79]:
# 내림차순
concat_df2.sort_values(by = 'B전자', ascending = False)

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0
2023-01-04  49000.0  62000.0  56000.0  5200.0  3200.0       3700.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0

## 데이터 삭제

In [80]:
concat_df2.drop('2023-01-04') # drop()에 index나 column을 넣어주면 됨

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0

In [84]:
concat_df2

               A텔레콤      B전자      C은행     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  54000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  55000.0  5100.0  3100.0       3600.0
2023-01-06  50000.0  63000.0  57000.0  5300.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  56950.0  5250.0  3250.0       3750.0

In [83]:
concat_df2.drop('2023-01-04', inplace = True)
concat_df2

KeyError: "['2023-01-04'] not found in axis"

In [85]:
concat_df2.drop('C은행', axis = 1) # 원래 기본은 axis = 0

               A텔레콤      B전자     D철강     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  5000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  5100.0  3100.0       3600.0
2023-01-06  50000.0  63000.0  5300.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  5250.0  3250.0       3750.0

In [86]:
concat_df2.drop(['C은행','D철강'], axis = 1) # 여러개는 리스트로 감싸주기

               A텔레콤      B전자     F화학  F화학_add_500
2023-01-02  48000.0  60000.0  3000.0       3500.0
2023-01-03  48500.0  61000.0  3100.0       3600.0
2023-01-06  50000.0  63000.0  3300.0       3800.0
2023-01-05  49950.0  62950.0  3250.0       3750.0

## 데이터프레임 다루기

In [87]:
# 컬럼과 컬럼 연산
concat_df2['A텔레콤_add_B전자'] = concat_df2['A텔레콤'] + concat_df2['B전자']
concat_df2.head()

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0
2023-01-03,48500.0,61000.0,55000.0,5100.0,3100.0,3600.0,109500.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0

In [88]:
concat_df2['sum'] = concat_df2.sum(axis = 1)

In [89]:
concat_df2

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,55000.0,5100.0,3100.0,3600.0,109500.0,285800.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0

In [90]:
concat_df2.min(axis = 0)

A텔레콤             48000.0
B전자              60000.0
C은행              54000.0
D철강               5000.0
F화학               3000.0
F화학_add_500       3500.0
A텔레콤_add_B전자    108000.0
sum             281500.0
dtype: float64

In [91]:
concat_df2.describe()

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.00000
mean,49112.500000,61737.500000,55737.500000,5162.500000,3162.500000,3662.500000,110850.000000,289425.00000
std,1016.837417,1486.256483,1486.256483,137.689264,137.689264,137.689264,2501.332978,6897.52371
min,48000.000000,60000.000000,54000.000000,5000.000000,3000.000000,3500.000000,108000.000000,281500.00000
25%,48375.000000,60750.000000,54750.000000,5075.000000,3075.000000,3575.000000,109125.000000,284725.00000
50%,49225.000000,61975.000000,55975.000000,5175.000000,3175.000000,3675.000000,111200.000000,290400.00000
75%,49962.500000,62962.500000,56962.500000,5262.500000,3262.500000,3762.500000,112925.000000,295100.00000
max,50000.000000,63000.000000,57000.000000,5300.000000,3300.000000,3800.000000,113000.000000,295400.00000

## 결측치 처리
- 제거: dropna
- 대체: fillna (특정 값으로 대체 or 메소드 활용), interpolate

In [95]:
import numpy as np

concat_df2.loc['2023-01-03', 'C은행':'F화학'] = np.NaN
concat_df2

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0

### 결측치 제거

In [96]:
concat_df2.dropna(axis = 0) # row 방향으로 NaN값이 있으면 제거

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0

In [97]:
concat_df2.dropna(axis = 1)

               A텔레콤      B전자  F화학_add_500  A텔레콤_add_B전자       sum
2023-01-02  48000.0  60000.0       3500.0      108000.0  281500.0
2023-01-03  48500.0  61000.0       3600.0      109500.0  285800.0
2023-01-06  50000.0  63000.0       3800.0      113000.0  295400.0
2023-01-05  49950.0  62950.0       3750.0      112900.0  295000.0

### 결측치 대체

In [99]:
concat_df2 = concat_df2.sort_index()
concat_df2

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [100]:
concat_df2.loc[pd.to_datetime('2023-01-04')] = concat_df2.loc[pd.to_datetime('2023-01-02')] + 100
concat_df2 = concat_df2.sort_index()

In [101]:
concat_df2

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [102]:
concat_df2.fillna(0) # 딱 봐도 0으로 넣으면 안될거 같음 > 시계열 데이터니까 무난하게 앞,뒤 데이터 활용하면 좋음

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,0.0,0.0,0.0,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [103]:
# 보간법
concat_df2.interpolate()

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,54050.0,5050.0,3050.0,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [104]:
concat_df2.fillna(method = 'ffill') # 앞에 있는 값으로 채움

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,54000.0,5000.0,3000.0,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [106]:
concat_df2.fillna(method = 'bfill') # 뒤에 있는 값으로 채움

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,54100.0,5100.0,3100.0,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

## 중복 제거
- drop_duplicates()

In [108]:
# 의도적으로 중복 데이터를 생성
concat_df3 = concat_df2.copy()
concat4 = pd.concat([concat_df2, concat_df3])
concat4

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [113]:
concat5 = concat4.drop_duplicates()
concat5

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-04,48100.0,60100.0,54100.0,5100.0,3100.0,3600.0,108100.0,281600.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

In [114]:
# 그냥 응용 한번
idx = concat4['F화학_add_500'].drop_duplicates().index

In [115]:
concat5.loc[idx,:]

,A텔레콤,B전자,C은행,D철강,F화학,F화학_add_500,A텔레콤_add_B전자,sum
2023-01-02,48000.0,60000.0,54000.0,5000.0,3000.0,3500.0,108000.0,281500.0
2023-01-03,48500.0,61000.0,NaN,NaN,NaN,3600.0,109500.0,285800.0
2023-01-05,49950.0,62950.0,56950.0,5250.0,3250.0,3750.0,112900.0,295000.0
2023-01-06,50000.0,63000.0,57000.0,5300.0,3300.0,3800.0,113000.0,295400.0

### [실습]

**Q1. 2022-01-01 ~ 2022-12-01 월초 인덱스를 생성**

In [120]:
dates = pd.date_range('2022-01-01', '2022-12-01', freq = 'MS') 
dates

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01'],
              dtype='datetime64[ns]', freq='MS')

**Q2. Q1에서 생성한 인덱스를 가지고 데이터프레임 생성(값은 자율, 이때 컬럼이름은 value)**

In [125]:
values = np.linspace(0,1000,12)
df = pd.DataFrame(values, index = dates)

# 컬럼명 바꾸기 - 많은 컬럼 바꿀때는 columns가 유리, 몇개만 바꾸면 rename
df.columns = ['value'] # df.rename(columns = {0:'value'}, inplace = True)
df

                  value
2022-01-01     0.000000
2022-02-01    90.909091
2022-03-01   181.818182
2022-04-01   272.727273
2022-05-01   363.636364
2022-06-01   454.545455
2022-07-01   545.454545
2022-08-01   636.363636
2022-09-01   727.272727
2022-10-01   818.181818
2022-11-01   909.090909
2022-12-01  1000.000000

**Q3. value 칼럼에서 100을 더한  value_add_100 칼럼을 생성해주세요.**

In [126]:
df['value_add_100'] = df['value'] + 100
df

                  value  value_add_100
2022-01-01     0.000000     100.000000
2022-02-01    90.909091     190.909091
2022-03-01   181.818182     281.818182
2022-04-01   272.727273     372.727273
2022-05-01   363.636364     463.636364
2022-06-01   454.545455     554.545455
2022-07-01   545.454545     645.454545
2022-08-01   636.363636     736.363636
2022-09-01   727.272727     827.272727
2022-10-01   818.181818     918.181818
2022-11-01   909.090909    1009.090909
2022-12-01  1000.000000    1100.000000

**Q4. value 칼럼과 value_add_100 칼럼을 평균한 mean 칼럼을 생성해주세요.**

In [127]:
df['mean'] = df.mean(axis = 1)
df

                  value  value_add_100         mean
2022-01-01     0.000000     100.000000    50.000000
2022-02-01    90.909091     190.909091   140.909091
2022-03-01   181.818182     281.818182   231.818182
2022-04-01   272.727273     372.727273   322.727273
2022-05-01   363.636364     463.636364   413.636364
2022-06-01   454.545455     554.545455   504.545455
2022-07-01   545.454545     645.454545   595.454545
2022-08-01   636.363636     736.363636   686.363636
2022-09-01   727.272727     827.272727   777.272727
2022-10-01   818.181818     918.181818   868.181818
2022-11-01   909.090909    1009.090909   959.090909
2022-12-01  1000.000000    1100.000000  1050.000000

$log(n)$